Revit 2027 API
FieldBuilder(Field, SchemaBuilder) Constructor
 Constructs a new FieldBuilder using the field and associated SchemaBuilder object.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldBuilder(
	Field field,
	SchemaBuilder builder
)
Public Sub New (
	field As Field,
	builder As SchemaBuilder
)
public:
FieldBuilder(
	Field^ field,
	SchemaBuilder^ builder
)
new :
        field : Field *
        builder : SchemaBuilder -> FieldBuilder
Parameters
field Field
builder SchemaBuilder
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FieldBuilder Class
FieldBuilder Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace